#Использовать asserts
#Использовать ".."
#Использовать "./Вспомогательные"

Перем Рефлектор; // Инстанс рефлектора

&Тест
Процедура Создается() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево();

	// Тогда

	Значение = Рефлектор.ПолучитьСвойство(АтомарноеБулево, "Значение");

	Ожидаем.Что(Значение)
		.ИмеетТип("Булево")
		.Равно(Ложь);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(Истина)
&ИсточникЗначение(Ложь)
Процедура СоздаетсяСНачальнымЗначением(НачальноеЗначение) Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(НачальноеЗначение);

	// Тогда

	Значение = Рефлектор.ПолучитьСвойство(АтомарноеБулево, "Значение");

	Ожидаем.Что(Значение)
		.ИмеетТип("Булево")
		.Равно(НачальноеЗначение);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(Истина)
&ИсточникЗначение(Ложь)
Процедура Получить(НачальноеЗначение) Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(НачальноеЗначение);

	// Когда

	Результаты = Вспомогательные.ВыполнитьВПятьПотоков(
		АтомарноеБулево,
		"Получить"
	);

	// Тогда

	Для Каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).Равно(НачальноеЗначение);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура УстановитьНеТотТип() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево();

	// Тогда

	Ожидаем.Что(АтомарноеБулево)
		.Метод("Установить", Вспомогательные.Массив(1))
		.ВыбрасываетИсключение("Устанавливаемое значение должно быть типа булево");

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(Истина)
&ИсточникЗначение(Ложь)
Процедура Установить(НачальноеЗначение) Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(НачальноеЗначение);

	// Когда

	Вспомогательные.ВыполнитьВПятьПотоков(
		АтомарноеБулево,
		"Установить",
		Не НачальноеЗначение
	);

	// Тогда

	Значение = Рефлектор.ПолучитьСвойство(АтомарноеБулево, "Значение");

	Ожидаем.Что(Значение)
		.ИмеетТип("Булево")
		.Равно(Не НачальноеЗначение);

КонецПроцедуры

&Тест
Процедура ПолучитьИУстановитьНеТотТип() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево();

	// Тогда

	Ожидаем.Что(АтомарноеБулево)
		.Метод("ПолучитьИУстановить", Вспомогательные.Массив(1))
		.ВыбрасываетИсключение("Устанавливаемое значение должно быть типа булево");

КонецПроцедуры

&Тест
Процедура ПолучитьИУстановить() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево();

	// Когда

	Результаты = Вспомогательные.ВыполнитьВПятьПотоков(
		АтомарноеБулево,
		"ПолучитьИУстановить",
		Истина
	);

	Лжей  = 0;
	Истин = 0;

	// Тогда
	Для Каждого Результат Из Результаты Цикл
		Лжей  = Лжей  + (Не Результат);
		Истин = Истин + Результат;
	КонецЦикла;

	Ожидаем.Что(Лжей).Равно(1);
	Ожидаем.Что(Истин).Равно(4);

КонецПроцедуры

&Тест
Процедура СравнитьИУстановитьНеТотТип() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево();

	// Тогда

	Ожидаем.Что(АтомарноеБулево)
		.Метод("СравнитьИУстановить", Вспомогательные.Массив(0, 1))
		.ВыбрасываетИсключение("Устанавливаемое значение должно быть типа булево");

КонецПроцедуры

&Тест
Процедура СравнитьИУстановитьНеТотТипПриНесовпадении() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(Ложь);

	// Тогда - тип нового значения проверяется и тогда, когда сравнение не совпало

	Ожидаем.Что(АтомарноеБулево)
		.Метод("СравнитьИУстановить", Вспомогательные.Массив(Истина, 1))
		.ВыбрасываетИсключение("Устанавливаемое значение должно быть типа булево");

КонецПроцедуры

&Тест
Процедура СравнитьИУстановить() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево();

	// Когда

	Результаты = Вспомогательные.ВыполнитьВПятьПотоков(
		АтомарноеБулево,
		"СравнитьИУстановить",
		Ложь,
		Истина
	);

	Лжей  = 0;
	Истин = 0;

	// Тогда

	Для Каждого Результат Из Результаты Цикл
		Лжей  = Лжей  + (Не Результат);
		Истин = Истин + Результат;
	КонецЦикла;

	Ожидаем.Что(Лжей).Равно(4);
	Ожидаем.Что(Истин).Равно(1);

КонецПроцедуры

&Тест
Процедура СравнитьИУстановитьУспех() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(Ложь);

	// Когда

	Результат = АтомарноеБулево.СравнитьИУстановить(Ложь, Истина);

	// Тогда

	Ожидаем.Что(Результат).Равно(Истина);
	Ожидаем.Что(АтомарноеБулево.Получить()).Равно(Истина);

КонецПроцедуры

&Тест
Процедура СравнитьИУстановитьНеУдача() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(Истина);

	// Когда

	Результат = АтомарноеБулево.СравнитьИУстановить(Ложь, Истина);

	// Тогда

	Ожидаем.Что(Результат).Равно(Ложь);
	Ожидаем.Что(АтомарноеБулево.Получить()).Равно(Истина);

КонецПроцедуры

&Тест
Процедура ПолучитьИУстановитьУспех() Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(Ложь);

	// Когда

	Результат = АтомарноеБулево.ПолучитьИУстановить(Истина);

	// Тогда

	Ожидаем.Что(Результат).Равно(Ложь);
	Ожидаем.Что(АтомарноеБулево.Получить()).Равно(Истина);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(Истина)
&ИсточникЗначение(Ложь)
Процедура ПреставлениеПереопределяется(НачальноеЗначение) Экспорт

	// Дано

	АтомарноеБулево = Новый АтомарноеБулево(НачальноеЗначение);

	// Когда

	Результат = Строка(АтомарноеБулево);

	// Тогда

	Ожидаем.Что(Результат).Равно(Строка(НачальноеЗначение));

КонецПроцедуры

Рефлектор = Новый Рефлектор();
