Перем Значение; // Текущее значение
Перем Блокировка; // Блокировка для изменения значения

// Получает текущее значение атомарного булева
//
// Возвращаемое значение:
//   Булево - текущее значение
//
Функция Получить() Экспорт

	Блокировка.Заблокировать();
	Результат = ПолучитьБезБлокировки();
	Блокировка.Разблокировать();

	Возврат Результат;

КонецФункции

// Устанавливает новое значение атомарного булева
//
// Параметры:
//   НовоеЗначение - Булево - новое значение
//
Процедура Установить(Знач НовоеЗначение) Экспорт

	Блокировка.Заблокировать();

	Попытка
		УстановитьБезБлокировки(НовоеЗначение);
	Исключение
		Блокировка.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	Блокировка.Разблокировать();

КонецПроцедуры

// Получает текущее значение и устанавливает новое
//
// Параметры:
//   НовоеЗначение - Булево - новое значение
//
// Возвращаемое значение:
//   Булево - предыдущее значение
//
Функция ПолучитьИУстановить(Знач НовоеЗначение) Экспорт

	Блокировка.Заблокировать();

	Попытка
		Результат = ПолучитьБезБлокировки();
		УстановитьБезБлокировки(НовоеЗначение);
	Исключение
		Блокировка.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	Блокировка.Разблокировать();

	Возврат Результат;

КонецФункции

// Сравнивает текущее значение с ожидаемым и устанавливает новое при успехе
//
// Параметры:
//   ОжидаемоеЗначение - Булево - ожидаемое значение
//   НовоеЗначение - Булево - новое значение
//
// Возвращаемое значение:
//   Булево - Истина если обновление прошло успешно, Ложь иначе
//
Функция СравнитьИУстановить(Знач ОжидаемоеЗначение, Знач НовоеЗначение) Экспорт

	// Тип нового значения проверяется и при несовпадении, когда УстановитьБезБлокировки не вызывается
	ПроверитьТип(НовоеЗначение);

	Блокировка.Заблокировать();

	Попытка
		Результат = ПолучитьБезБлокировки() = ОжидаемоеЗначение;

		Если Результат Тогда
			УстановитьБезБлокировки(НовоеЗначение);
		КонецЕсли;
	Исключение
		Блокировка.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	Блокировка.Разблокировать();

	Возврат Результат;

КонецФункции

Процедура ОбработкаПолученияПредставления(Представление, СтандартнаяОбработка) // BSLLS:UnusedLocalMethod-off
	СтандартнаяОбработка = Ложь;
	Представление = Строка(Получить());
КонецПроцедуры

Функция ПолучитьБезБлокировки()
	Возврат Значение;
КонецФункции

Процедура УстановитьБезБлокировки(Знач НовоеЗначение)
	ПроверитьТип(НовоеЗначение);
	Значение = НовоеЗначение;
КонецПроцедуры

Процедура ПроверитьТип(НовоеЗначение)
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		ВызватьИсключение "Устанавливаемое значение должно быть типа булево";
	КонецЕсли;
КонецПроцедуры

Процедура ПриСозданииОбъекта(НачальноеЗначение = Ложь)
	Блокировка = Новый БлокировкаРесурса(ЭтотОбъект);
	УстановитьБезБлокировки(НачальноеЗначение);
КонецПроцедуры
